# coding:utf-8
#!/usr/bin/env python

__author__ = 'XingHua'

b = u"""
秦铁路" 股票名字
27.55" 今日开盘价
27.25" 昨日收盘价
26.91" 当前价格
27.55" 今日最高价
26.20" 今日最低价
26.91" 竞买价
26.92" 竞卖价
22114263" 成交的股票数
589824680" 成交金额
"4695" 买一
"26.91" 买一
"57590" 买二
"26.90" 买二
"14700" 买三
"26.89" 买三
"14300" 买四
"26.88" 买四
"15100" 买五
"26.87" 买五
"3100" 卖一
"26.92" 卖一
"2008-01-11" 日期
"15-05-32" 时间
"""
# (22, 23), (24, 25), (26,27), (28, 29)分别为“卖二”至“卖四的情况”
res = []
b = b.split()
print b
for index, each in enumerate(b):
    if index % 2 != 0:
        print r'"' + each + '"'
        res.append(r'"' + each + '"')


def main():
    hq_str_sh601006 = u"大秦铁路,7.50,7.55,7.55,7.60,7.45,7.54,7.55,53216365,400285989,47200,7.54,54999,7.53,11800,7.52,110100,7.51,152400,7.50,9700,7.55,446800,7.56,333065,7.57,731677,7.58,565000,7.59,2014-10-14,15 03 03,00";
    # hq_str_sh601006.split()
    zz = hq_str_sh601006.split()
    print "zz=", zz[0]
    for each, each1 in zip(res, zz):
        print each, each1


if __name__ == "__main__":
    main()


"""
0: "大秦铁路"，股票名字；
1: "27.55"，今日开盘价；
2: "27.25"，昨日收盘价；
3: "26.91"，当前价格；
4: "27.55"，今日最高价；
5: "26.20"，今日最低价；
6: "26.91"，竞买价，即“买一”报价；
7: "26.92"，竞卖价，即“卖一”报价；
8: "22114263"，成交的股票数，由于股票交易以一百股为基本单位，
               所以在使用时，通常把该值除以一百；
9: "589824680"，成交金额，单位为“元”，为了一目了然，
                通常以“万元”为成交金额的单位，
                所以通常把该值除以一万；
10: "4695"，“买一”申请4695股，即47手；
11: "26.91"，“买一”报价；
12: "57590"，“买二”
13: "26.90"，“买二”
14: "14700"，“买三”
15: "26.89"，“买三”
16: "14300"，“买四”
17: "26.88"，“买四”
18: "15100"，“买五”
19: "26.87"，“买五”
20: "3100"，“卖一”申报3100股，即31手；
21: "26.92"，“卖一”报价
(22, 23), (24, 25), (26,27), (28, 29)分别为“卖二”至“卖四的情况”
30: "2008-01-11"，日期；
31: "15:05:32"，时间；
"""